#+TITLE: Org Beamerposter

** Beamer specific markup for Org Mode

Org mode will understand that a heading is of a given *block* type by reading the ~BEAMER_env~ property of a heading. Instead of manually typing the environment type, simply press =C-c C-b= to open a menu with further shortcuts.

Here's a list of some of the available environments:

#+BEGIN_SRC emacs-lisp :eval never
(mapcar 'car org-beamer-environments-default)
#+END_SRC

#+RESULTS:
| block | alertblock | verse | quotation | quote | structureenv | theorem | definition | example | exampleblock | proof | beamercolorbox |

Setting the environment block with =org-beamer-select-environment= will not only add or update the correct the heading's ~BEAMER_env~ property, but also add a tag named ~B_environment~ that is helpful for the overview display (described further down). If a block environment accepts environment specific arguments, they can be defined manually by setting the property ~BEAMER_envargs~. 

The same interface introduced for defining blocks also enables the definition of columns. Use the option ~|~ (vertical slash) to define a column, i.e., =C-c C-b |=. Setting the column with =org-beamer-select-environment= will not only add or update the correct the heading's ~BEAMER_col~ property, but also add a tag named ~BMCOL~.

Columns also have widths, which are given as a proportion of the total frame size. For example, a column width of 0.4 means that a given column will ocupy 40% of the frame. 

*Note that Org Mode will not keep track of the sum of your column sizes. If your columns add to a value greater than 1, then the export will probably break.**

